Revit 2026 API

# GenericGenericIsMetal Property

---

The property labeled "Highlights" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericIsMetal { get; }
```
```vb
Public Shared ReadOnly Property GenericIsMetal As String
	Get
```
```cpp
public:
static property String^ GenericIsMetal {
	String^ get ();
}
```
```fsharp
static member GenericIsMetal : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace